# Redis持久化
Redis的持久化可以理解为全量持久化和增量持久化。
其实所有的持久化不都是全量和增量。

## RDB（全量）
**什么是RDB持久化？**
```
RDB持久化就是把当前进程数据生成快照保存到硬盘的过程。
可手动或自动触发。
```

**bgsave**
```
bgsave就是fork一个子进程，持久化的过程由这个子进程来完成。
fork是一个比较重量级的操作，阻塞也就发生在fork阶段。
可手动或自动触发
```

自动触发RDB 
```
1. 使用save相关配置， save m n 表示在m秒内数据存在n次修改，自动触发bgsave。
2. 如果节点执行全量复制操作，主节点自动执行bagsave。
3. 重新加载redis的时候，也会触发自动save操作。
4. 默认情况下执行shutduwn命令时，如果没有开启AOF持久化也是自动执行bgsave。
```

.RDB文件
```
.RDB文件是一个紧凑的二进制文件。
可以想一下，二进制文件的好处？
1. 读取比较快，读取速度远大于AOF文件。
2. 体积比较小，方便落盘和在节点间同步文件。

Redis在每一次执行bgsave的时候，子进程会创建一个新的rdb文件，
```
